## Data Frame 
#### Data Frame is a group of Pandas Series objects that share the same index. It is table of columns and rows in pandas that we can easily restructure and filter.

In [2]:
import numpy as np
import pandas as pd
import os

In [3]:
np.random.seed(101)
mydata= np.random.randint(0,101, (4,3))
mydata

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [4]:

#If you only provide the random array, pandas will automatically index.
df = pd.DataFrame(mydata)
df

    0   1   2
0  95  11  81
1  70  63  87
2  75   9  77
3  40   4  63

In [5]:
#However, we can also add our own index, as well as column names
myindex = ['CA', 'NY', 'AZ', 'TX']
mycolumns = ['Jan', 'Feb', 'Mar']
df = pd.DataFrame(data = mydata, index=myindex ,columns= mycolumns)
df

    Jan  Feb  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [6]:
#most often, data frames are read in through a file though, not through arrays made in python.
#Its important to first know what our working directory is:
os.getcwd()
#To change the current working directory:
os.chdir("C:\\Users\\sfrie\\Python\\pandas\\udemy_pandas_files")

In [7]:
#Print all files in current directory
os.listdir()

['.ipynb_checkpoints',
 '00-Series.ipynb',
 '01-DataFrames.ipynb',
 '02-Conditional-Filtering.ipynb',
 '03-Useful-Methods.ipynb',
 '04-Missing-Data.ipynb',
 '05-Groupby-Operations-and-MultiIndex.ipynb',
 '06-Combining-DataFrames.ipynb',
 '07-Text-Methods.ipynb',
 '08-Time-Methods.ipynb',
 '09-Inputs-and-Outputs.ipynb',
 '10-Pivot-Tables.ipynb',
 '11-Pandas-Project-Exercise .ipynb',
 '12-Pandas-Project-Exercise-Solution.ipynb',
 'example.csv',
 'example.xlsx',
 'hotel_booking_data.csv',
 'movie_scores.csv',
 'mpg.csv',
 'my_excel_file.xlsx',
 'newfile.csv',
 'new_file.csv',
 'new_workbook.xlsx',
 'reshaping_pivot.png',
 'RetailSales_BeerWineLiquor.csv',
 'Sales_Funnel_CRM.csv',
 'sample_table.html',
 'simple.html',
 'tips.csv',
 '__pycache__']

In [8]:
#If the wanted file is in the workng directory, then we can read the file with:
df = pd.read_csv('tips.csv') 
#or (Keep in mind that we need double '\\')
df = pd.read_csv("C:\\Users\\sfrie\\Python\\pandas\\udemy_pandas_files\\tips.csv")
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [9]:
#Column info
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

In [10]:
#Row info
df.index

RangeIndex(start=0, stop=244, step=1)

In [11]:
#Reports just the first several rows given of a data frame (takes amount of rows as an arguement.)
#df.tail will give you the end of the data frame.
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [13]:
#We see in the Dtypes that there are int objects. This means that we can run statistical evaluation on it.
df.describe()
#Or, run df.describe().transpose()

       total_bill         tip        size  price_per_person     CC Number
count  244.000000  244.000000  244.000000        244.000000  2.440000e+02
mean    19.785943    2.998279    2.569672          7.888197  2.563496e+15
std      8.902412    1.383638    0.951100          2.914234  2.369340e+15
min      3.070000    1.000000    1.000000          2.880000  6.040679e+10
25%     13.347500    2.000000    2.000000          5.800000  3.040731e+13
50%     17.795000    2.900000    2.000000          7.255000  3.525318e+15
75%     24.127500    3.562500    3.000000          9.390000  4.553675e+15
max     50.810000   10.000000    6.000000         20.270000  6.596454e+15

## Working With Columns

In [14]:
#To grab a specific column, we reference with df:
df['total_bill']

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [15]:
#To grab multiple columns: (Note, the double brackets)
df[['total_bill', 'tip']]

     total_bill   tip
0         16.99  1.01
1         10.34  1.66
2         21.01  3.50
3         23.68  3.31
4         24.59  3.61
..          ...   ...
239       29.03  5.92
240       27.18  2.00
241       22.67  2.00
242       17.82  1.75
243       18.78  3.00

[244 rows x 2 columns]

In [16]:
#To create a new column. we reference our new column as if it was already created (like a dictionary)

df['tip_percentage'] = 100* df['tip'] / df['total_bill']

In [17]:
#Keep in mind, when trying to create a column with the same name as an existing column, it will just overwrite the existing data in that column.
#We can use numpy to round our data
df['price_per_person'] = np.round(df['total_bill'] / df['size'], 2)
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765

In [18]:
#To delete a column or row, we use drop and change the axis reference (default is to drop a row)
#Without assigning to a variable, the changes won't be permanent. If we want the changes to be permanent, there are two options: 1) change inplace arguement to True, or to assign to a variable (most common)
df =df.drop('tip_percentage', axis=1)

In [19]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

## Working With Rows

In [20]:
#Payment_id in our table has only unique values. Lets make it our tables index.
df = df.set_index("Payment ID")
df
#Keep in mind that payment Id is not longer a column.

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...
Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

In [21]:
#If we realize we made a mistake, we can reset the index and return payment Id back to a column.
#df = df.reset_index()

In [22]:
#If we wnat to to grab a single row, we can grab it from either its numeric location, or its labeled index location.
#1) indexed location
df.iloc[0]
#2) labeled index location
df.loc['Sun2959']

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Name: Sun2959, dtype: object

In [23]:
#To grab multiple rows based off iloc, we can use slice notation:
#1) index location
df.iloc[0:4]
#2) labeled index
df.loc[['Sun4608', 'Sun2251']]
#We can also add a second arguement to either functions to specify columns. E.g. df.iloc[[1,3,4], [1,2]]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221

### Removing and Inserting rows

In [24]:

#If we want to remove a row, we use drop, like with column. Here, axis = 0
df.drop('Sun2959', axis = 0).head()
#IMPORTANT: If we have a labelled index to our data frame, we can not use drop for the index location (df.drop(0, axis = 0)). Instead, we can use slicing to only select the rows we want (df = df.iloc[1:])

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
Sun9679,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882

In [25]:
#Inserting a new row
one_row = df.iloc[0]
one_row
df = df.append(one_row)
#Pandas only accepts row inserts that match the column count of the data frame.

In [26]:
###This created a duplicate row in our data set though, which we don't want.